app/controllers/linkpage_controller.rb

  def index
	@links = Link.order(:catgory)
---
SELECT "links".* FROM "links"   ORDER BY "links"."catgory" ASC