app/controllers/links_controller.rb

  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("address", "catgory", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "name" = ?, "updated_at" = ? WHERE "links"."id" = 3  [["name", "Clould VMs list"], ["updated_at", "2014-04-17 14:41:33.013791"]]