app/controllers/pdfviews_controller.rb

  def index
    @pdfviews = Pdfview.all
---
SELECT "pdfviews".* FROM "pdfviews"

  def create
    @pdfview = Pdfview.new(pdfview_params)
	upload
	@pdfview.name = @filename.gsub(".pdf", "")
	@pdfview.path = "#{Rails.root}/public/uploads/" + @filename

    respond_to do |format|
      if @pdfview.save
---
INSERT INTO "pdfviews" ("created_at", "doctype", "name", "path", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-13 01:28:23.353300"], ["doctype", "doc"], ["name", "pdf"], ["path", "/pdf"], ["updated_at", "2014-05-13 01:28:23.353300"]]

  def update
    respond_to do |format|
      if @pdfview.update(pdfview_params)
---
UPDATE "pdfviews" SET "doctype" = ?, "updated_at" = ? WHERE "pdfviews"."id" = 14  [["doctype", " Product"], ["updated_at", "2014-05-19 01:45:40.207404"]]

  def destroy
    @pdfview.destroy
---
DELETE FROM "pdfviews" WHERE "pdfviews"."id" = ?  [["id", 1]]

    def set_pdfview
      @pdfview = Pdfview.find(params[:id])
---
SELECT  "pdfviews".* FROM "pdfviews"  WHERE "pdfviews"."id" = ? LIMIT 1  [["id", 14]]