app/controllers/previewpage_controller.rb

SELECT "pdfviews".* FROM "pdfviews"   ORDER BY "pdfviews"."doctype" ASC
SELECT "pdfviews".* FROM "pdfviews"
---
  def index
   @pdfnames=Pdfview.order(:doctype)
   @pdf_groups=@pdfnames.group_by{ |pdf| pdf.doctype}